RIET/src/Documents/PlanningRentalCosts/PlanningRentalCosts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PlanningRentalCosts</name>
  <registerRecords>InformationRegister.PlanningCosts</registerRecords>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PlanningCosts</name>
    <attributes>
      <name>Transport</name>
      <type>
        <types>CatalogRef.Transport</types>
      </type>
    </attributes>
    <attributes>
      <name>ServiceProvider</name>
      <type>
        <types>CatalogRef.ServiceProviders</types>
      </type>
    </attributes>
    <attributes>
      <name>Equipment</name>
      <type>
        <types>CatalogRef.Equipments</types>
      </type>
    </attributes>
    <attributes>
      <name>PlanCosts</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>PlanCostsUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/PlanningCosts/PlanningCosts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PlanningCosts</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>SumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SubGeomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/rgsBudgetSums/rgsBudgetSums.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>rgsBudgetSums</name>
  <registerRecords>InformationRegister.MobillizationBudget</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.rgsBudgetSums</registerRecords>
  <attributes>
    <name>BudgetType</name>
    <type>
      <types>CatalogRef.rgsBudgetType</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Budget</name>
    <attributes>
      <name>Geomarket</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualEntrySum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManualEntryPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Summa</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RevenuePercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RevenueSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Budget_MS</name>
    <attributes>
      <name>Geomarket</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>SubGeomarket</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>SubSegment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>InternationalDomestic</name>
      <type>
        <types>EnumRef.DomesticInternational</types>
      </type>
    </attributes>
    <attributes>
      <name>Summa</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Mobillization</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.КонтрагентыLawson</types>
      </type>
    </attributes>
    <attributes>
      <name>ServiceProvider</name>
      <type>
        <types>CatalogRef.ServiceProviders</types>
      </type>
    </attributes>
    <attributes>
      <name>TypeOfTransport</name>
      <type>
        <types>CatalogRef.Equipments</types>
      </type>
    </attributes>
    <attributes>
      <name>Geomarket</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>CatalogRef.Cities</types>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>EnumRef.Locations</types>
      </type>
    </attributes>
    <attributes>
      <name>Summa</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TnKm</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Period</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/PlanningRentalCosts/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	PlanningRentalCosts.Ссылка
	|ИЗ
	|	Документ.PlanningRentalCosts КАК PlanningRentalCosts
	|ГДЕ
	|	PlanningRentalCosts.Дата МЕЖДУ &Дата1 И &Дата2
	|	И НЕ PlanningRentalCosts.ПометкаУдаления
	|	И PlanningRentalCosts.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 тогда
				
		ТранспортГеомаркет = Новый ТаблицаЗначений;
		ТранспортГеомаркет.Колонки.Добавить("Транспорт");
		ТранспортГеомаркет.Колонки.Добавить("Geomarket");
		ТранспортГеомаркет.Колонки.Добавить("Sum");
		Для Каждого Строка ИЗ PlanningCosts Цикл
			Если ЗначениеЗаполнено(Строка.Transport.Geomarket)   Тогда
				Если Строка.PlanCostsUSD <> 0 Тогда
					СтрокаТранспортГеомаркет = ТранспортГеомаркет.Добавить();
					СтрокаТранспортГеомаркет.Транспорт = Строка.Transport;
					СтрокаТранспортГеомаркет.Geomarket = Строка.Transport.Geomarket;
					СтрокаТранспортГеомаркет.Sum = Строка.PlanCostsUSD;
				КонецЕсли;
			Иначе
				Message = New UserMessage();
				Message.Text = "Для Траспортного средства " + Строка.Transport + " в строке - " + Строка.НомерСтроки + ", не установлен геомаркет";
				Message.Message();				
			КонецЕсли;
		КонецЦикла;
		
		Движения.PlanningCosts.Записывать = Истина;
		Движения.PlanningCosts.Очистить();
		
		Геомаркеты = ТранспортГеомаркет.Скопировать();
		Геомаркеты.Свернуть("Geomarket");	
		ТаблицаПроцентовПоГеомаркетам = Документы.rgsBudgetSums.ПолучитьТаблицуДвижений(Геомаркеты, Дата);
		Для Каждого Геомаркет из Геомаркеты Цикл	
			Отбор = Новый Структура;
			Отбор.Вставить("Geomarket", Геомаркет.Geomarket);
			Транспорт = ТранспортГеомаркет.Скопировать(Отбор);
			ПроцентовкаПоГеомаркету = ТаблицаПроцентовПоГеомаркетам.Скопировать(Отбор);
			ПроцентовкаПоГеомаркету.Свернуть("Geomarket, SubGeomarket, Segment, SubSegment", "Percent");
			Для Каждого Машина ИЗ Транспорт Цикл
				
				Для каждого Процент ИЗ ПроцентовкаПоГеомаркету Цикл
					Если НЕ Отказ Тогда
						Движение = Движения.PlanningCosts.Добавить();
						Движение.Период = Дата;
						Движение.Transport = Машина.Транспорт;
						Движение.ServiceProvider = Машина.Транспорт.ServiceProvider;
						Движение.Geomarket = Процент.Geomarket;
						Движение.SubGeomarket = Процент.SubGeomarket;
						Движение.Segment = Процент.Segment;
						Движение.SubSegment = Процент.SubSegment; 
						Движение.SumUSD = Процент.Percent * Машина.Sum;
						Движение.Регистратор = Ссылка;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		Отказ = Истина;
		Message = New UserMessage();
		Message.Text = "В этом месяце уже был проведен документ планирования затрат на аренду транспортных средств";
		Message.Message();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Дата = НачалоМесяца(Дата);
	
	ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	ModificationDate = ТекущаяДата();
	
КонецПроцедуры
